app/views/songs/_form.html.erb

  <%= f.text_field :artist_name %><br><br>
  <%= f.select :artist_id, options_from_collection_for_select(Artist.all, :id, :name) %>
---
SELECT "artists".* FROM "artists"